![](https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Pandas_logo.svg/1200px-Pandas_logo.svg.png)

# <center> LESSON 5: Introduction to PANDAS </center>

## 1. INTRODUCTION

### 1.1 What is Pandas?

`Pandas = Panel Data`

### 1.2 Installation

- Cài đặt khi tạo môi trường ảo:
```
conda create -n hanh python=3.7 pandas
```
- Cài đặt sau khi tạo xong môi trường ảo:
```
conda install pandas
```
hoặc 
```
pip install pandas
```

### 1.3 Import

In [6]:
import pandas as pd
# Phu hop DL dang bang, time series, dang chuoi. SD cho DL it chieu, nhieu chieu thi xu ly tren numpy. 
# De dang xu ly DL, truc quan hoa DL.

In [9]:
type(df)

pandas.core.frame.DataFrame

**Reference**: 
- [Pandas Cheatsheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)
- [Python for Data Analysis](https://bedford-computing.co.uk/learning/wp-content/uploads/2015/10/Python-for-Data-Analysis.pdf)

## 2. BASICS

### 2.1 Objects in Pandas

- **DataFrame**: table, `pd.DataFrame()`
- **Series**: column, `pd.Series()`

![](https://media.geeksforgeeks.org/wp-content/cdn-uploads/creating_dataframe1.png)
![](https://analyticssavvy.com/wp-content/uploads/2020/05/series-and-dataframe.png)

#### 2.1.1 How to create a DataFrame

1. Tạo ra 1 DataFrame rỗng

In [8]:
import pandas as pd
df=pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

2. Tạo ra 1 DataFrame từ dict

In [10]:
dict1={'Name':['Cuong','Mai','Nghia'],'Age':[18,25,30],'Uni':['A','B','C']}
df1=pd.DataFrame(dict1,index=[f'student{i}' for i in range(1,4)]) #Doi ten cua index
df1

           Name  Age Uni
student1  Cuong   18   A
student2    Mai   25   B
student3  Nghia   30   C

3. Tạo ra 1 DataFrame từ list của list

In [11]:
li=[['Cuong',10,'A'],['Mai',25,'B'],['Nghia',18,'C']]
df2=pd.DataFrame(li,columns=['Name','Age','Uni'])
df2

    Name  Age Uni
0  Cuong   10   A
1    Mai   25   B
2  Nghia   18   C

4. Tạo ra 1 DataFrame từ zip

In [12]:
Name=['Cuong','Mai','Nghia']
Age=[18,25,30]
Uni=['A','B','C']
#zip: match tung phan tu trong cac index cua list voi nhau
df3=pd.DataFrame(list(zip(Name,Age,Uni)))
df3

       0   1  2
0  Cuong  18  A
1    Mai  25  B
2  Nghia  30  C

5. Tạo từ 1 chuỗi numpy

In [13]:
import numpy as np
df4=pd.DataFrame(np.linspace(1,16,16).reshape(4,4))
df4

      0     1     2     3
0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0
2   9.0  10.0  11.0  12.0
3  13.0  14.0  15.0  16.0

#### 2.1.2 How to create a Series

In [14]:
pd.Series({'Name':['Cuong','Mai','Nghia']})

Name    [Cuong, Mai, Nghia]
dtype: object

In [15]:
df2['Name'] #Cach nay goi dc nhieu cot hon va ten cot co _

0    Cuong
1      Mai
2    Nghia
Name: Name, dtype: object

In [16]:
df2.Name

0    Cuong
1      Mai
2    Nghia
Name: Name, dtype: object

### 2.2 I/O

Link: https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data

In [17]:
#pd.read_{ten_kieu_file}:pd.read_csv()/excel()/sql(): Load file
#pd.to_{ten_kieu_file}: Save file
df=pd.read_csv('Ecommerce Purchases') # Dien day du path cua file
df.head(5) #df.tail(5): Doc 5 dong cuoi, df.sample(5): Doc random 5 dong

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
0,"16629 Pace Camp Apt. 448\r\nAlexisborough, NE ...",46 in,PM,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Martinez-Herman,6011929061123406,02/20,900,JCB 16 digit,pdunlap@yahoo.com,"Scientist, product/process development",149.146.147.205,el,98.14
1,"9374 Jasmine Spurs Suite 508\r\nSouth John, TN...",28 rn,PM,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,"Fletcher, Richards and Whitaker",3337758169645356,11/18,561,Mastercard,anthony41@reed.com,Drilling engineer,15.160.41.51,fr,70.73
2,Unit 0065 Box 5052\r\nDPO AP 27450,94 vE,PM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Simpson, Williams and Pham",675957666125,08/19,699,JCB 16 digit,amymiller@morales-harrison.com,Customer service manager,132.207.160.22,de,0.95
3,"7780 Julia Fords\r\nNew Stacy, WA 45798",36 vm,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_0 ...,"Williams, Marshall and Buchanan",6011578504430710,02/24,384,Discover,brent16@olson-robinson.info,Drilling engineer,30.250.74.19,es,78.04
4,"23012 Munoz Drive Suite 337\r\nNew Cynthia, TX...",20 IE,AM,Opera/9.58.(X11; Linux x86_64; it-IT) Presto/2...,"Brown, Watson and Andrews",6011456623207998,10/25,678,Diners Club / Carte Blanche,christopherwright@gmail.com,Fine artist,24.140.33.94,es,77.82

### 2.3 Indexing

Chọn tất cả các dòng (slicing):
- `loc`: location `df.loc[row_label,col_label]`, `series.loc[row_label]`
- `iloc`: index location `df.iloc[row_index,col_index]`, `series.iloc[row_index]`

Chọn 1 cell:
- `at`:  `df.at[row_label,col_label]`
- `iat`: `df.iat[row_index,col_index]`

In [21]:
import seaborn as sns

tips_df = sns.load_dataset('tips')
tips_df.head(5)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [22]:
tips_df.loc[1,'total_bill']

10.34

In [23]:
tips_df.iloc[1,0]

10.34

In [24]:
tips_df.iat[1,0]

10.34

In ra 6 dong dau tien tu cot total_bill den sex

In [25]:
tips_df.loc[:4,:'sex']

   total_bill   tip     sex
0       16.99  1.01  Female
1       10.34  1.66    Male
2       21.01  3.50    Male
3       23.68  3.31    Male
4       24.59  3.61  Female

In [26]:
tips_df.iloc[:5,:3] #index inclusive start, exclusive end

   total_bill   tip     sex
0       16.99  1.01  Female
1       10.34  1.66    Male
2       21.01  3.50    Male
3       23.68  3.31    Male
4       24.59  3.61  Female

In [27]:
tips_df['total_bill'].to_frame()

     total_bill
0         16.99
1         10.34
2         21.01
3         23.68
4         24.59
..          ...
239       29.03
240       27.18
241       22.67
242       17.82
243       18.78

[244 rows x 1 columns]

In [28]:
pd.DataFrame(tips_df['total_bill'])

     total_bill
0         16.99
1         10.34
2         21.01
3         23.68
4         24.59
..          ...
239       29.03
240       27.18
241       22.67
242       17.82
243       18.78

[244 rows x 1 columns]

In [ ]:
# tips_df[['total_bill']]

In [29]:
pd.options.display.max_rows = None
pd.options.display.max_columns = None

In [30]:
tips_df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

### 2.4 Masking

In [ ]:
### 2.4 Masking

- `df_name.loc[conditions]` 
- `df_name[conditions]`
- `df_name.query(conditions)`

In [31]:
tips_df.head(5)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

Loc ra tat cac cac thong tin cua nhung khach hang la nu voi `tips_df`

In [32]:
tips_df.loc[tips_df['sex'] == 'Female'].head(3)

    total_bill   tip     sex smoker  day    time  size
0        16.99  1.01  Female     No  Sun  Dinner     2
4        24.59  3.61  Female     No  Sun  Dinner     4
11       35.26  5.00  Female     No  Sun  Dinner     4

In [33]:
tips_df[tips_df['sex'] == 'Female'].head(3)

    total_bill   tip     sex smoker  day    time  size
0        16.99  1.01  Female     No  Sun  Dinner     2
4        24.59  3.61  Female     No  Sun  Dinner     4
11       35.26  5.00  Female     No  Sun  Dinner     4

### 2.5 Operations

#### 2.5.1 Groupby

![](https://blog.dask.org/images/split-apply-combine.png)

In [20]:
tips_df.head(3)

NameError: name 'tips_df' is not defined

#### 2.5.2 Pivot

#### 2.5.3 Others

|Merge methods| SQL Join Name | Meaning| _merge|
|-|-|-|-|
|left| LEFT OUTER JOIN|Chỉ sử dụng keys bên trái|left_only|
|right| RIGHT OUTER JOIN|Chỉ sử dụng keys bên phải|right_only|
|outer|FULL OUTER JOIN|Sử dụng keys của cả 2 dataframes|both|
|inner|INNER JOIN|Chỉ sử dụng keys giao nhau của 2 dataframes|both|

![](https://lh3.googleusercontent.com/-n76c6dtr5sw/YBO5d-3PzGI/AAAAAAAAAh8/xiT6YIzePLEXArb8uU1f1vgg8JRXYeg8ACLcBGAsYHQ/image.png)